avnet-iotconnect/stm32n6570_dk_w6x_iot_reference/Appli/Core/Src/ota_pal/ota_pal_stm32n6_xspi.c
/*
 * FreeRTOS STM32 Reference Integration
 * Copyright (C) 2021 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/**
 * @file ota_pal.c Contains non-secure side platform abstraction layer implementations
 * for AWS OTA update library.
 */

#include "logging_levels.h"
#define LOG_LEVEL    LOG_INFO
#include "logging.h"

#include <string.h>

#include "FreeRTOS.h"
#include "task.h"

#include "ota.h"
#include "ota_pal.h"
#include "main.h"
#include "lfs.h"
#include "lfs_port.h"

#include "mbedtls/pk.h"
#include "mbedtls/md.h"
#include "mbedtls_error_utils.h"

#include "PkiObject.h"

#include "stm32_extmem.h"
#include "stm32_extmem_conf.h"
#include "xspi_nor_mx66uw1g45g.h"


#define FLASH_START_INACTIVE_BANK    ( ( uint32_t ) ( FLASH_BASE + FLASH_BANK_SIZE ) )

#define NUM_QUAD_WORDS( length )         ( length >> 4UL )

#define NUM_REMAINING_BYTES( length )    ( length & 0x0F )

#define IMAGE_CONTEXT_FILE_NAME    "/ota/image_state"

#define OTA_IMAGE_MIN_SIZE         ( 16 )


typedef enum
{
    OTA_PAL_NOT_INITIALIZED = 0,
    OTA_PAL_READY,
    OTA_PAL_FILE_OPEN,
    OTA_PAL_PENDING_ACTIVATION,
    OTA_PAL_PENDING_SELF_TEST,
    OTA_PAL_NEW_IMAGE_BOOTED,
    OTA_PAL_NEW_IMAGE_WDT_RESET,
    OTA_PAL_SELF_TEST_FAILED,
    OTA_PAL_ACCEPTED,
    OTA_PAL_REJECTED,
    OTA_PAL_INVALID
} OtaPalState_t;

static const char * ppcPalStateString[] =
{
    "Not Initialized",
    "Ready",
    "File Open",
    "Pending Activation",
    "Pending Self Test",
    "New Image Booted",
    "Watchdog Reset",
    "Self Test Failed",
    "Accepted",
    "Rejected",
    "Invalid"
};

typedef struct
{
    OtaPalState_t xPalState;
    uint32_t ulFileTargetBank;
} OtaPalNvContext_t;

typedef struct
{
    uint32_t ulTargetBank;
    uint32_t ulPendingBank;
    uint32_t ulBaseAddress;
    uint32_t ulImageSize;
    OtaPalState_t xPalState;
} OtaPalContext_t;


const char OTA_JsonFileSignatureKey[] = "sig-sha256-ecdsa";

static OtaPalContext_t xPalContext =
{
    .xPalState     = OTA_PAL_NOT_INITIALIZED,
    .ulTargetBank  = 0,
    .ulPendingBank = 0,
    .ulBaseAddress = 0,
    .ulImageSize   = 0,
};

static uint32_t ulBankAtBootup = 0;

/* Static function forward declarations */

/* Load/Save/Delete */
static BaseType_t prvInitializePalContext( OtaPalContext_t * pxContext );
static BaseType_t prvWritePalNvContext( OtaPalContext_t * pxContext );
static BaseType_t prvDeletePalNvContext( void );
static OtaPalContext_t * prvGetImageContext( void );

/* Active / Inactive bank helpers */
static uint32_t prvGetActiveBank( void );
static uint32_t prvGetInactiveBank( void );

/* STM32 HAL Wrappers */
static HAL_StatusTypeDef prvFlashSetDualBankMode( void );
static BaseType_t prvSelectBank( uint32_t ulNewBank );
static uint32_t prvGetBankSettingFromOB( void );

static void prvOptionByteApply( void );

/* Flash write./erase */
static HAL_StatusTypeDef prvWriteToFlash( uint32_t destination,
                                          uint8_t * pSource,
                                          uint32_t length );

static BaseType_t prvEraseBank( uint32_t bankNumber );

/* Verify signature */
static OtaPalStatus_t prvValidateSignature( const char * pcPubKeyLabel,
                                            const unsigned char * pucSignature,
                                            const size_t uxSignatureLength,
                                            const unsigned char * pucImageHash,
                                            const size_t uxHashLength );

static BaseType_t xCalculateImageHash( const unsigned char * pucImageAddress,
                                       const size_t uxImageLength,
                                       unsigned char * pucHashBuffer,
                                       size_t uxHashBufferLength,
                                       size_t * puxHashLength );

const char * otaImageStateToString( OtaImageState_t xState )
{
    const char * pcStateString;

    switch( xState )
    {
        case OtaImageStateTesting:
            pcStateString = "OtaImageStateTesting";
            break;

        case OtaImageStateAccepted:
            pcStateString = "OtaImageStateAccepted";
            break;

        case OtaImageStateRejected:
            pcStateString = "OtaImageStateRejected";
            break;

        case OtaImageStateAborted:
            pcStateString = "OtaImageStateAborted";
            break;

        default:
        case OtaImageStateUnknown:
            pcStateString = "OtaImageStateUnknown";
            break;
    }

    return pcStateString;
}

const char * otaPalImageStateToString( xPalImageState )
{
    const char * pcPalImageState;

    switch( xPalImageState )
    {
        case OtaPalImageStatePendingCommit:
            pcPalImageState = "OtaPalImageStatePendingCommit";
            break;

        case OtaPalImageStateValid:
            pcPalImageState = "OtaPalImageStateValid";
            break;

        case OtaPalImageStateInvalid:
            pcPalImageState = "OtaPalImageStateInvalid";
            break;

        default:
        case OtaPalImageStateUnknown:
            pcPalImageState = "OtaPalImageStateUnknown";
            break;
    }

    return pcPalImageState;
}

static const char * pcPalStateToString( OtaPalState_t xPalState )
{
    const char * pcStateString = "";

    if( xPalState <= OTA_PAL_INVALID )
    {
        pcStateString = ppcPalStateString[ xPalState ];
    }

    return pcStateString;
}

