avnet-iotconnect/stm32n6570_dk_w6x_iot_reference/Appli/Core/Src/ota_pal/ota_pal_stm32n6_xspi.c
            xHalStatus = HAL_FLASHEx_OBProgram( &xObContext );

            ( void ) HAL_FLASH_OB_Lock();
            ( void ) HAL_FLASH_Lock();
        }

        xResult = ( xHalStatus == HAL_OK ) ? pdTRUE : pdFALSE;
    }
#endif
    return xResult;
}

static void prvOptionByteApply( void )
{
#if 0
    vPetWatchdog();

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        vTaskSuspendAll();
    }

    LogSys( "Option Byte Launch in progress." );

    /* Drain log buffers */
    vDyingGasp();


    ( void ) HAL_FLASH_Unlock();
    ( void ) HAL_FLASH_OB_Unlock();
    /* Generate System Reset to load the new option byte values ***************/
    /* On successful option bytes loading the system should reset and control should not return from this function. */
    ( void ) HAL_FLASH_OB_Launch();
#endif
}

static uint32_t prvGetActiveBank( void )
{
    if( ulBankAtBootup == 0 )
    {
        ulBankAtBootup = prvGetBankSettingFromOB();
    }

    return ulBankAtBootup;
}

static uint32_t prvGetBankSettingFromOB( void )
{
    uint32_t ulCurrentBank = 0UL;
#if 0
    FLASH_OBProgramInitTypeDef xObContext = { 0 };

    /* Get the Dual boot configuration status */
    HAL_FLASHEx_OBGetConfig( &xObContext );

    if( ( xObContext.USERConfig & OB_SWAP_BANK_ENABLE ) == OB_SWAP_BANK_ENABLE )
    {
        ulCurrentBank = FLASH_BANK_2;
    }
    else
    {
        ulCurrentBank = FLASH_BANK_1;
    }
#endif
    return ulCurrentBank;
}

static uint32_t prvGetInactiveBank( void )
{
    uint32_t ulActiveBank = prvGetActiveBank();

    uint32_t ulInactiveBank;
#if 0
    if( ulActiveBank == FLASH_BANK_1 )
    {
        ulInactiveBank = FLASH_BANK_2;
    }
    else if( ulActiveBank == FLASH_BANK_2 )
    {
        ulInactiveBank = FLASH_BANK_1;
    }
    else
    {
        ulInactiveBank = 0UL;
    }
#endif
    return ulInactiveBank;
}

static HAL_StatusTypeDef prvWriteToFlash( uint32_t destination,
                                          uint8_t * pSource,
                                          uint32_t ulLength )
{
    HAL_StatusTypeDef status = HAL_OK;
#if 0
    uint32_t i = 0U;
    uint8_t quadWord[ 16 ] = { 0 };
    uint32_t numQuadWords = NUM_QUAD_WORDS( ulLength );
    uint32_t remainingBytes = NUM_REMAINING_BYTES( ulLength );

    /* Unlock the Flash to enable the flash control register access *************/
    HAL_FLASH_Unlock();

    for( i = 0U; i < numQuadWords; i++ )
    {
        /* Pet the watchdog */
        vPetWatchdog();

        /* Device voltage range supposed to be [2.7V to 3.6V], the operation will
         * be done by word */

        memcpy( quadWord, pSource, 16UL );
        status = HAL_FLASH_Program( FLASH_TYPEPROGRAM_QUADWORD, destination, ( uint32_t ) quadWord );

        if( status == HAL_OK )
        {
            /* Check the written value */
            if( memcmp( ( void * ) destination, quadWord, 16UL ) != 0 )
            {
                /* Flash content doesn't match SRAM content */
                status = HAL_ERROR;
            }
        }

        if( status == HAL_OK )
        {
            /* Increment FLASH destination address and the source address. */
            destination += 16UL;
            pSource += 16UL;
        }
        else
        {
            break;
        }
    }

    if( status == HAL_OK )
    {
        if( remainingBytes > 0 )
        {
            memcpy( quadWord, pSource, remainingBytes );
            memset( ( quadWord + remainingBytes ), 0xFF, ( 16UL - remainingBytes ) );

            status = HAL_FLASH_Program( FLASH_TYPEPROGRAM_QUADWORD, destination, ( uint32_t ) quadWord );

            if( status == HAL_OK )
            {
                /* Check the written value */
                if( memcmp( ( void * ) destination, quadWord, 16UL ) != 0 )
                {
                    /* Flash content doesn't match SRAM content */
                    status = HAL_ERROR;
                }
            }
        }
    }

    /* Lock the Flash to disable the flash control register access (recommended
     *  to protect the FLASH memory against possible unwanted operation) *********/
    HAL_FLASH_Lock();
#endif
    return status;
}

static BaseType_t prvEraseBank( uint32_t bankNumber )
{
    BaseType_t xResult = pdTRUE;
#if 0
    configASSERT( ( bankNumber == FLASH_BANK_1 ) || ( bankNumber == FLASH_BANK_2 ) );

    configASSERT( bankNumber != prvGetActiveBank() );

    if( HAL_FLASH_Unlock() == HAL_OK )
    {
        uint32_t pageError = 0U;
        FLASH_EraseInitTypeDef pEraseInit;
#if defined(STM32H5)
        pEraseInit.TypeErase = FLASH_TYPEERASE_MASSERASE;
        pEraseInit.Banks = bankNumber;
        pEraseInit.Sector = 0;
        pEraseInit.NbSectors = FLASH_SECTOR_NB;
#else
        pEraseInit.Banks = bankNumber;
        pEraseInit.NbPages = FLASH_PAGE_NB;
        pEraseInit.Page = 0U;
        pEraseInit.TypeErase = FLASH_TYPEERASE_MASSERASE;
#endif
        if( HAL_FLASHEx_Erase( &pEraseInit, &pageError ) != HAL_OK )
        {
            LogError( "Failed to erase the flash bank, errorCode = %u, pageError = %u.", HAL_FLASH_GetError(), pageError );
            xResult = pdFALSE;
        }

        ( void ) HAL_FLASH_Lock();
    }
    else
    {
        LogError( "Failed to lock flash for erase, errorCode = %u.", HAL_FLASH_GetError() );
        xResult = pdFALSE;
    }
#endif
    return xResult;
}

static BaseType_t xCalculateImageHash( const unsigned char * pucImageAddress,
                                       const size_t uxImageLength,
                                       unsigned char * pucHashBuffer,
                                       size_t uxHashBufferLength,
                                       size_t * puxHashLength )
{
    BaseType_t xResult = pdTRUE;
    const mbedtls_md_info_t * pxMdInfo = NULL;

    pxMdInfo = mbedtls_md_info_from_type( MBEDTLS_MD_SHA256 );

    configASSERT( pucHashBuffer != NULL );
    configASSERT( pucImageAddress != NULL );
    configASSERT( uxImageLength > 0 );
    configASSERT( uxHashBufferLength > 0 );

