avnet-iotconnect/stm32n6570_dk_w6x_iot_reference/Appli/Core/Src/ota_pal/ota_pal_stm32n6_xspi.c
    if( pxMdInfo == NULL )
    {
        LogError( "Failed to initialize mbedtls md_info object." );
        xResult = pdFALSE;
    }
    else if( mbedtls_md_get_size( pxMdInfo ) > uxHashBufferLength )
    {
        LogError( "Hash buffer is too small." );
        xResult = pdFALSE;
    }
    else
    {
        int lRslt = 0;
        size_t uxHashLength = 0;

        uxHashLength = mbedtls_md_get_size( pxMdInfo );

        configASSERT( uxHashLength <= MBEDTLS_MD_MAX_SIZE );

        lRslt = mbedtls_md( pxMdInfo, pucImageAddress, uxImageLength, pucHashBuffer );

        MBEDTLS_MSG_IF_ERROR( lRslt, "Failed to compute hash of the staged firmware image." );

        if( lRslt != 0 )
        {
            xResult = pdFALSE;
        }
        else
        {
            *puxHashLength = uxHashLength;
        }
    }

    return xResult;
}

static OtaPalStatus_t prvValidateSignature( const char * pcPubKeyLabel,
                                            const unsigned char * pucSignature,
                                            const size_t uxSignatureLength,
                                            const unsigned char * pucImageHash,
                                            const size_t uxHashLength )
{
    OtaPalStatus_t uxStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );

    PkiObject_t xOtaSigningPubKey;
    mbedtls_pk_context xPubKeyCtx;

    configASSERT( pcPubKeyLabel != NULL );
    configASSERT( pucImageHash != NULL );
    configASSERT( uxHashLength > 0 );

    if( ( pucSignature == NULL ) || ( uxSignatureLength <= 0 ) )
    {
        uxStatus = OTA_PAL_COMBINE_ERR( OtaPalBadSignerCert, 0 );
        return uxStatus;
    }

    mbedtls_pk_init( &xPubKeyCtx );

    xOtaSigningPubKey = xPkiObjectFromLabel( pcPubKeyLabel );

    if( xPkiReadPublicKey( &xPubKeyCtx, &xOtaSigningPubKey ) != PKI_SUCCESS )
    {
        LogError( "Failed to load OTA Signing public key." );
        uxStatus = OTA_PAL_COMBINE_ERR( OtaPalBadSignerCert, 0 );
    }

    /* Verify the provided signature against the image hash */
    if( OTA_PAL_MAIN_ERR( uxStatus ) == OtaPalSuccess )
    {
        int lRslt = mbedtls_pk_verify( &xPubKeyCtx, MBEDTLS_MD_SHA256,
                                       pucImageHash, uxHashLength,
                                       pucSignature, uxSignatureLength );

        if( lRslt != 0 )
        {
            MBEDTLS_MSG_IF_ERROR( lRslt, "OTA Image signature verification failed." );
            uxStatus = OTA_PAL_COMBINE_ERR( OtaPalSignatureCheckFailed, lRslt );
        }
    }

    mbedtls_pk_free( &xPubKeyCtx );

    return uxStatus;
}

OtaPalStatus_t otaPal_CreateFileForRx( OtaFileContext_t * const pxFileContext )
{
    OtaPalStatus_t uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
#if 0
    OtaPalContext_t * pxContext = prvGetImageContext();

    /* Handle back to back updates */
    if( ( pxContext->xPalState == OTA_PAL_ACCEPTED ) ||
        ( pxContext->xPalState == OTA_PAL_REJECTED ) )
    {
        pxContext->xPalState = OTA_PAL_READY;
    }

    LogInfo( "CreateFileForRx: xPalState: %s", pcPalStateToString( pxContext->xPalState ) );

    if( ( pxFileContext->fileSize > FLASH_BANK_SIZE ) ||
        ( pxFileContext->fileSize < OTA_IMAGE_MIN_SIZE ) )
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileTooLarge, 0 );
    }
    else if( strncmp( "b_u585i_iot02a_ntz.bin", ( char * ) pxFileContext->pFilePath, pxFileContext->filePathMaxSize ) != 0 )
    {
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    else if( ( pxContext == NULL ) ||
             ( pxContext->xPalState != OTA_PAL_READY ) )
    {
        LogError( "OTA PAL context is NULL or not in the OTA_PAL_READY state." );
        uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
    }
    else
    {
        uint32_t ulTargetBank = 0UL;

        /* Set dual bank mode if not already set. */
        if( prvFlashSetDualBankMode() != HAL_OK )
        {
            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            ulTargetBank = prvGetInactiveBank();

            if( ulTargetBank == 0UL )
            {
                uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
            }
        }

        if( ( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess ) &&
            ( prvEraseBank( ulTargetBank ) != pdTRUE ) )
        {
            uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalRxFileCreateFailed, 0 );
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            pxContext->ulTargetBank = ulTargetBank;
            pxContext->ulPendingBank = prvGetActiveBank();
            pxContext->ulBaseAddress = FLASH_START_INACTIVE_BANK;
            pxContext->ulImageSize = pxFileContext->fileSize;
            pxContext->xPalState = OTA_PAL_FILE_OPEN;
            pxFileContext->pFile = pxContext;
        }

        if( OTA_PAL_MAIN_ERR( uxOtaStatus ) == OtaPalSuccess )
        {
            if( prvDeletePalNvContext() == pdFALSE )
            {
                uxOtaStatus = OTA_PAL_COMBINE_ERR( OtaPalBootInfoCreateFailed, 0 );
            }
        }
    }
#endif
    return uxOtaStatus;
}

int16_t otaPal_WriteBlock( OtaFileContext_t * const pxFileContext,
                           uint32_t offset,
                           uint8_t * const pData,
                           uint32_t blockSize )
{
    int16_t sBytesWritten = -1;
    OtaPalContext_t * pxContext = prvGetImageContext();

    configASSERT( pxContext->ulTargetBank != prvGetActiveBank() );

    configASSERT( blockSize < INT16_MAX );

    if( ( pxFileContext == NULL ) ||
        ( pxFileContext->pFile != ( uint8_t * ) ( pxContext ) ) )
    {
        LogError( "File context is invalid." );
    }
    else if( pxContext == NULL )
    {
        LogError( "PAL context is invalid." );
    }
    else if( ( offset + blockSize ) > pxContext->ulImageSize )
    {
        LogError( "Offset and blockSize exceeds image size" );
    }
    else if( pxContext->xPalState != OTA_PAL_FILE_OPEN )
    {
        LogError( "Invalid PAL State. otaPal_WriteBlock may only occur when file is open." );
    }
    else if( pData == NULL )
    {
        LogError( "pData is NULL." );
    }
    else if( prvWriteToFlash( ( pxContext->ulBaseAddress + offset ), pData, blockSize ) == HAL_OK )
    {
        sBytesWritten = ( int16_t ) blockSize;
    }

    return sBytesWritten;
}

